{
    "CURSO": "BACHARELADO EM ENGENHARIA DE SOFTWARE",
    "CODIGO_DO_CURSO": "GRA014170R",
    "DURACAO": "4 anos",
    "CARGA_HORARIA": "3200h + 320h de Atividades Complementares = 3520h + ENADE",
    "DISCIPLINAS": [
        {
            "SEMESTRE": 1,
            "CODIGO": "FBJ8006",
            "ORDEM": 1,
            "DISCIPLINA": "Direito Digital",
            "EMENTA": "Estudo dos conceitos gerais de Internet. Análise e reflexão sobre a privacidade, imagem e proteção de dados pessoais na Internet. Definição da responsabilidade civil dos usuários e provedores de Internet. Análise do Direito Autoral na Internet. Caracterização da proteção jurídica do software.",
            "NAT": "FBD",
            "HORAS": 40
        },
        {
            "SEMESTRE": 1,
            "CODIGO": "FBX5000",
            "ORDEM": 2,
            "DISCIPLINA": "Tópicos de Ciências Exatas",
            "EMENTA": "Estudo de tópicos elementares de Física, Química e Matemática a partir da metodologia de aprendizagem baseada em problemas de uma forma interdisciplinar.",
            "NAT": "FBP",
            "HORAS": 80
        },
        {
            "SEMESTRE": 1,
            "CODIGO": "FBI4001",
            "ORDEM": 3,
            "DISCIPLINA": "Programação de Computadores I",
            "EMENTA": "Resolução de problemas computacionais utilizando uma linguagem de programação. Caracterização de tipos de dados e variáveis.  Estudo e emprego de estruturas de controle condicionais e de repetição. Modularização e reutilização de CODIGO. Representação de dados utilizando estruturas unidimensionais de dados homogêneos.",
            "NAT": "FBP",
            "HORAS": 80
        },
        {
            "SEMESTRE": 1,
            "CODIGO": "FBI4002",
            "ORDEM": 4,
            "DISCIPLINA": "Lógica para Computação",
            "EMENTA": "Desenvolvimento de conhecimentos básicos de lógica matemática, através da construção de provas de teoremas utilizando regras de dedução natural e cálculo de predicados. Verificação da sintaxe de fórmulas bem formadas com base na semântica de fórmulas da lógica proposicional e da lógica de predicados. Formalização de argumentos usando linguagem lógica e prova de sua validade usando dedução natural. Estudo das noções de validade e consistência de argumentos, utilizando elementos da Matemática.",
            "NAT": "FBP",
            "HORAS": 80
        },
        {
            "SEMESTRE": 1,
            "CODIGO": "FBI4003",
            "ORDEM": 5,
            "DISCIPLINA": "Matemática Discreta",
            "EMENTA": "Estudo da teoria dos conjuntos e seu uso em expressões algébricas, utilizando resultados notáveis e suas propriedades. Investigação do conceito e das propriedades de relações para estabelecimento de relações de equivalência, de ordem e de funções parciais e totais. Apresentar as principais ferramentas de contagem e conceitos de sequência para uso em demonstrações indutivas. Caracterizar e empregar as principais estruturas algébricas a partir dos conceitos de operações binárias e suas propriedades.",
            "NAT": "FBP",
            "HORAS": 40
        },
        {
            "SEMESTRE": 1,
            "CODIGO": "FBI4000",
            "ORDEM": 6,
            "DISCIPLINA": "Introdução à Computação e Tecnologias",
            "EMENTA": "Estudo das áreas de conhecimento da Ciência da Computação. Contextualização do Projeto Pedagógico do Curso. Reflexão sobre as principais aplicações e fatos históricos da área. Construção de vocabulário próprio da área. Elaboração do perfil do profissional. Caracterização do pensamento analítico computacional. Definição das etapas da resolução de problemas. Desenvolvimento de projetos de software. Reflexão sobre questões étnico-raciais e de gênero. Reflexão sobre inclusão e tecnologias assistivas. Integração entre os alunos. Introdução à Escrita Científica.",
            "NAT": "FBP",
            "HORAS": 80
        },
        {
            "SEMESTRE": 2,
            "CODIGO": "FGU8001",
            "ORDEM": 7,
            "DISCIPLINA": "Sociedade, Cultura e Cidadania",
            "EMENTA": "Compreensão das transformações estruturais da sociedade brasileira contemporânea. Análise dos processos sociais no contexto da globalização. Estudo das garantias de Direitos e Políticas Públicas e dos dilemas socioambientais.",
            "NAT": "FGD",
            "HORAS": 80
        },
        {
            "SEMESTRE": 2,
            "CODIGO": "FBI4013",
            "ORDEM": 8,
            "DISCIPLINA": "Programação de Computadores II",
            "EMENTA": "Resolução de problemas computacionais utilizando uma linguagem de programação.  Estudo e emprego de alocação de memória contígua. Compreensão e utilização de arquivos de dados. Representação de dados utilizando estruturas multidimensionais de dados homogêneos\/heterogêneos. Estudo e utilização de operações binárias.",
            "NAT": "FBP",
            "HORAS": 80,
            "PREREQUISITOS": 3
        },
        {
            "SEMESTRE": 2,
            "CODIGO": "FBX5010",
            "ORDEM": 9,
            "DISCIPLINA": "Cálculo Diferencial e Integral I",
            "EMENTA": "Estudo do conceito de derivada de funções de uma variável real e sua aplicação na resolução de problemas da Engenharia. Desenvolvimento do conceito de antiderivada sua e aplicação na resolução de equações diferenciais ordinárias de 1ª ordem de variáveis separadas.",
            "NAT": "FBP",
            "HORAS": 80,
            "PREREQUISITOS": 2
        },
        {
            "SEMESTRE": 2,
            "CODIGO": "FBX4025",
            "ORDEM": 10,
            "DISCIPLINA": "Sistemas Digitais I",
            "EMENTA": "Estudo dos sistemas numéricos e álgebra booleana como a base teórica de sistemas digitais. Simplificação e minimização de funções lógicas. Análise e síntese de circuitos lógicos. Estudo do funcionamento dos sistemas digitais combinacionais (portas lógicas, multiplexadores, demultiplexadores, codificadores, decodificadores, somadores e Unidade Lógica e Aritmética) e sequenciais (flip-flops, registradores paralelos e seriais, contadores). Estudo e análise de dispositivos de memória.",
            "NAT": "FEP",
            "HORAS": 80
        },
        {
            "SEMESTRE": 2,
            "CODIGO": "FBX4007",
            "ORDEM": 11,
            "DISCIPLINA": "Teoria da Computação",
            "EMENTA": "Estudo de noções de programas e máquinas. Desenvolvimento da noção de computabilidade efetiva. Caracterização de máquinas de registradores e de máquina de Turing. Discussão a respeito da Tese de Church. Definição de funções recursivas. Caracterização da solucionabilidade de problemas.",
            "NAT": "FEP",
            "HORAS": 80,
            "PREREQUISITOS": 4
        },
        {
            "SEMESTRE": 3,
            "CODIGO": "FBX8000",
            "ORDEM": 12,
            "DISCIPLINA": "Estatística",
            "EMENTA": "Conceitos básicos: população, amostra e variáveis. Estatística descritiva: gráficos e tabelas, medidas de tendência central, medidas de variabilidade e separatrizes. Gráfico box-plot. Distribuição de frequências e histograma. Correlação linear e regressão linear.",
            "NAT": "FBD",
            "HORAS": 40,
            "PREREQUISITOS": 9
        },
        {
            "SEMESTRE": 3,
            "CODIGO": "FBI4019",
            "ORDEM": 13,
            "DISCIPLINA": "Fundamentos de Arquitetura de Computadores",
            "EMENTA": "Estudo da organização de sistemas de computação. Estabelecimento das relações entre a arquitetura e a programação de computadores. Características do hardware que influenciam na programação de computadores. Caracterização da arquitetura de computador.",
            "NAT": "FBP",
            "HORAS": 80,
            "PREREQUISITOS": "8, 10"
        },
        {
            "SEMESTRE": 3,
            "CODIGO": "FBI4014",
            "ORDEM": 14,
            "DISCIPLINA": "Programação Orientada a Objetos",
            "EMENTA": "Conceituação do paradigma de orientação a objetos. Identificação, análise e aplicação de métodos e técnicas de uma linguagem orientada a objetos para a implementação de algoritmos.",
            "NAT": "FBP",
            "HORAS": 80,
            "PREREQUISITOS": 8
        },
        {
            "SEMESTRE": 3,
            "CODIGO": "FBI4005",
            "ORDEM": 15,
            "DISCIPLINA": "Algoritmos e Estrutura de Dados I",
            "EMENTA": "Resolução de problemas computacionais utilizando uma linguagem de programação.  Estudo e emprego de alocação de memória contígua. Compreensão e utilização de arquivos de dados. Representação de dados utilizando estruturas multidimensionais de dados homogêneos\/heterogêneos. Estudo e utilização de operações binárias.",
            "NAT": "FBP",
            "HORAS": 80,
            "PREREQUISITOS": 8
        },
        {
            "SEMESTRE": 3,
            "CODIGO": "FGU8006",
            "ORDEM": 16,
            "DISCIPLINA": "Optativa de Formação Geral",
            "NAT": "FGD",
            "HORAS": 40
        },
        {
            "SEMESTRE": 3,
            "CODIGO": "ADS3001",
            "ORDEM": 17,
            "DISCIPLINA": "Projeto Temático I",
            "EMENTA": "Planejamento e aplicação de um projeto atual em Análise e Desenvolvimento de Sistemas. Definição de sua estrutura, organização e processo de elaboração. Desenvolvimento de trabalho interdisciplinar em equipe. Resolução de problemas reais. Concepção e desenvolvimento de um sistema computacional. Integração, de forma interdisciplinar, das aprendizagens construídas nos diferentes componentes curriculares.",
            "NAT": "FEP",
            "HORAS": 80,
            "PREREQUISITOS": "3"
        },
        {
            "SEMESTRE": 4,
            "CODIGO": "FGU8007",
            "ORDEM": 18,
            "DISCIPLINA": "Optativa de Formação Geral",
            "NAT": "FGD",
            "HORAS": 40
        },
        {
            "SEMESTRE": 4,
            "CODIGO": "FGU8008",
            "ORDEM": 19,
            "DISCIPLINA": "Optativa de Formação Geral",
            "NAT": "FGD",
            "HORAS": 40
        },
        {
            "SEMESTRE": 4,
            "CODIGO": "FBI4009",
            "ORDEM": 20,
            "DISCIPLINA": "Fundamentos de Banco de Dados",
            "EMENTA": "Introdução ao estudo sobre sistemas de banco de dados. Definição da estrutura de Sistemas de Gerência de Banco de Dados. Estudo de modelos de bancos de dados: modelo de dados conceitual (Entidade-Relacionamento\/orientado a objetos) e físico (Relacional - Álgebra relacional - Normalização \/objeto-relacional). Estudos de casos versando sobre linguagem de consultas, definição e manipulação de dados (SQL).",
            "NAT": "FBP",
            "HORAS": 80,
            "PREREQUISITOS": 3
        },
        {
            "SEMESTRE": 4,
            "CODIGO": "FBI4010",
            "ORDEM": 21,
            "DISCIPLINA": "Fundamentos de Engenharia de Software",
            "EMENTA": "Contextualização e introdução aos conceitos básicos de Engenharia de Software. Aplicação de um processo de desenvolvimento e técnicas de modelagem durante o ciclo de vida do software usando métodos ágeis.",
            "NAT": "FBP",
            "HORAS": 80,
            "PREREQUISITOS": 14
        },
        {
            "SEMESTRE": 4,
            "CODIGO": "ENS4000",
            "ORDEM": 22,
            "DISCIPLINA": "Gerência de Configuração",
            "EMENTA": "Em construção",
            "NAT": "FEP",
            "HORAS": 80,
            "PREREQUISITOS": 3
        },
        {
            "SEMESTRE": 4,
            "CODIGO": "FBX4039",
            "ORDEM": 23,
            "DISCIPLINA": "Arquitetura de Computadores",
            "EMENTA": "Estudo da arquitetura e organização de sistemas de computação modernos. Estabelecimento das relações entre a arquitetura e a programação em linguagem de montagem. ",
            "NAT": "FEP",
            "HORAS": 80,
            "PREREQUISITOS": 13
        },
        {
            "SEMESTRE": 5,
            "CODIGO": "ENS4001",
            "ORDEM": 24,
            "DISCIPLINA": "Qualidade de Software",
            "EMENTA": "Em construção",
            "NAT": "FED",
            "HORAS": 40,
            "PREREQUISITOS": 3
        },
        {
            "SEMESTRE": 5,
            "CODIGO": "FBI4011",
            "ORDEM": 25,
            "DISCIPLINA": "Fundamentos de Inteligência Artificial",
            "EMENTA": "Conceituação e evolução da Inteligência Artificial. Conceituação e análise da representação do Conhecimento. Exame de questões sobre representação do senso comum. Estudo sobre raciocínio automático. Resolução de problemas de busca em espaço de estados. Aplicação de Heurísticas na resolução de problemas. Análise de problemas na forma de jogos. Caracterização da área de processamento de linguagem natural. Aplicação e análise de técnicas de processamento de linguagem natural. Estudo sobre aprendizagem de máquina. Conceituação e aplicação de algoritmos para aprendizagem simbólica e por reforço.",
            "NAT": "FBP",
            "HORAS": 80,
            "PREREQUISITOS": 8
        },
        {
            "SEMESTRE": 5,
            "CODIGO": "FBI4016",
            "ORDEM": 26,
            "DISCIPLINA": "Projeto e Arquitetura de Software",
            "EMENTA": "Definição de arquitetura de software. Estudo sobre arquiteturas e projeto arquitetural. Modelagem de arquiteturas. Análise e implementação de linguagens de descrição de arquitetura (ADL). Aplicação de reuso de software. Estudo e implementação de Camadas e Componentes de Software. Análise e utilização de frameworks para desenvolvimento de aplicações.",
            "NAT": "FBP",
            "HORAS": 40,
            "PREREQUISITOS": 14
        },
        {
            "SEMESTRE": 5,
            "CODIGO": "FBX4052",
            "ORDEM": 27,
            "DISCIPLINA": "Fundamentos de Sistemas Operacionais",
            "EMENTA": "Estudo dos principais componentes de um sistema operacional e das técnicas usadas para o desenvolvimento dos mesmos. Compreensão da importância do sistema operacional para o controle e utilização dos recursos do computador.",
            "NAT": "FBP",
            "HORAS": 80,
            "PREREQUISITOS": "8, 23"
        },
        {
            "SEMESTRE": 5,
            "CODIGO": "FBI8000",
            "ORDEM": 28,
            "DISCIPLINA": "Processo de Desenvolvimento de Software",
            "EMENTA": "Contextualização e introdução sobre os diferentes tipos de processo de desenvolvimento de software. Aplicação de um processo de desenvolvimento e técnicas de modelagem durante o ciclo de vida do software, usando métodos ágeis e tradicionais com a aplicação das técnicas de projeto da camada de domínio\/negócio, da camada de apresentação e da camada de persistência, utilizando UML (Unified Modelling Language).",
            "NAT": "FBD",
            "HORAS": 80,
            "PREREQUISITOS": 21
        },
        {
            "SEMESTRE": 5,
            "CODIGO": "FBI4012",
            "ORDEM": 29,
            "DISCIPLINA": "Laboratório de Software",
            "EMENTA": "Planejamento e desenvolvimento de uma aplicação web através da aplicação do processo de desenvolvimento de software em um problema real. Laboratório de Software (LASIS).",
            "NAT": "FBP",
            "HORAS": 80,
            "PREREQUISITOS": "14 ,21"
        },
        {
            "SEMESTRE": 6,
            "CODIGO": "FBI8001",
            "ORDEM": 30,
            "DISCIPLINA": "Fundamentos de Redes de Computadores",
            "EMENTA": "Conceituação e identificação das arquiteturas de redes de computadores. Conceituação das camadas da arquitetura TCP\/IP: física, enlace, rede, transporte e aplicação. Conceituação, identificação, análise e aplicação dos principais protocolos da arquitetura TCP\/IP. Conceituação e aplicação dos princípios do projeto de endereçamento IP. Contribuição das aplicações de rede na TI Verde.",
            "NAT": "FBD",
            "HORAS": 80,
            "PREREQUISITOS": 13
        },
        {
            "SEMESTRE": 6,
            "CODIGO": "FBX4054",
            "ORDEM": 31,
            "DISCIPLINA": "Inteligência Computacional",
            "EMENTA": "Conceituação de Inteligência Artificial. Conceituação de Computação Evolutiva e aplicação de algoritmos genéticos. Estudo sobre a aprendizagem de máquina e dos principais algoritmos para a sua implementação. Conceituação de Conexionismo e estudo de modelos de Redes Neurais. Estudo sobre Tratamento da Incerteza e de técnicas para construção de sistemas de raciocínio probabilístico. Estudo sobre a Lógica Fuzzy. Conceituação de Sistemas Multiagentes e aplicação em problemas de planejamento e robótica.",
            "NAT": "FEP",
            "HORAS": 80,
            "PREREQUISITOS": 8
        },
        {
            "SEMESTRE": 6,
            "CODIGO": "ADS3004",
            "ORDEM": 32,
            "DISCIPLINA": "Projeto Temático II",
            "EMENTA": "Planejamento e aplicação de um projeto atual em Análise e Desenvolvimento de Sistemas. Definição de sua estrutura, organização e processo de elaboração. Desenvolvimento de trabalho interdisciplinar em equipe. Resolução de problemas reais. Concepção e desenvolvimento de um sistema computacional. Integração, de forma interdisciplinar, das aprendizagens construídas nos diferentes componentes curriculares.",
            "NAT": "FEP",
            "HORAS": 80,
            "PREREQUISITOS": "17, 14, 20, 26"
        },
        {
            "SEMESTRE": 6,
            "CODIGO": "ADS3003",
            "ORDEM": 33,
            "DISCIPLINA": "Programação de Aplicações Web I",
            "EMENTA": "Estudo de técnicas de programação, com níveis maiores de complexidade, voltados para o ambiente da Internet. Estudo das arquiteturas para o desenvolvimento de aplicações para a Internet. Estudo das principais tecnologias para o desenvolvimento das camadas front-end de aplicações web.",
            "NAT": "FEP",
            "HORAS": 80,
            "PREREQUISITOS": 14
        },
        {
            "SEMESTRE": 6,
            "CODIGO": "FBI4006",
            "ORDEM": 34,
            "DISCIPLINA": "Computação Aplicada I",
            "EMENTA": "Planejamento e aplicação de um projeto atual em Ciência da Computação. Definição de sua estrutura, organização e processo de elaboração. Desenvolvimento de trabalho interdisciplinar em equipe. Resolução de problemas reais. Concepção e desenvolvimento de um sistema computacional. Integração, de forma interdisciplinar, das aprendizagens construídas nos diferentes componentes curriculares. Desenvolvimento de um artigo com os resultados do projeto desenvolvido.",
            "NAT": "FEP",
            "HORAS": 80,
            "PREREQUISITOS": 29
        },
        {
            "SEMESTRE": 7,
            "CODIGO": "ADS3005",
            "ORDEM": 35,
            "DISCIPLINA": "Integração de Aplicações",
            "EMENTA": "Caracterização, contextualização e análise de integrações de diferentes aplicações e plataformas.",
            "NAT": "FEP",
            "HORAS": 80,
            "PREREQUISITOS": 20
        },
        {
            "SEMESTRE": 7,
            "CODIGO": "FBI4015",
            "ORDEM": 36,
            "DISCIPLINA": "Programação para Dispositivos Móveis",
            "EMENTA": "Estudo de sistemas operacionais para dispositivos móveis. Análise de recursos de hardware disponíveis para dispositivos móveis. Comparação de Modelos de aplicações para dispositivos móveis. Aplicações nativas; WebViews; Aplicativos híbridos; Acesso à serviços remotos; Frameworks de desenvolvimento. Modelagem e Implementação de aplicativos para dispositivos móveis. Elaboração e Desenvolvimento de um projeto.",
            "NAT": "FEP",
            "HORAS": 80,
            "PREREQUISITOS": 14
        },
        {
            "SEMESTRE": 7,
            "CODIGO": "FBI4017",
            "ORDEM": 37,
            "DISCIPLINA": "Trabalho de Conclusão de Curso I",
            "EMENTA": "Elaboração da proposta de um projeto de aplicação de computação científica. Levantamento Bibliográfico e elaboração de uma proposta de solução. Definição de sua estrutura, organização e processo de elaboração. Desenvolvimento de trabalho interdisciplinar individual. Resolução de problemas reais relacionados a computação científica. Concepção de um sistema computacional. Integração, de forma interdisciplinar, das aprendizagens construídas nos diferentes componentes curriculares. Desenvolvimento de um artigo ou monografia com os resultados do projeto desenvolvido.",
            "NAT": "FEP",
            "HORAS": 20,
            "PREREQUISITOS": "34 + 2400h"
        },
        {
            "SEMESTRE": 7,
            "CODIGO": "ADS3006",
            "ORDEM": 38,
            "DISCIPLINA": "Programação de Aplicações Web II",
            "EMENTA": "Estudo de técnicas de programação, com níveis maiores de complexidade, voltados para o desenvolvimento de back-ends robustos. Estudo das arquiteturas para o desenvolvimento de aplicações para a Internet.  Estudo das tecnologias para a construção de back-ends de aplicações web.",
            "NAT": "FEP",
            "HORAS": 80,
            "PREREQUISITOS": "14, 20, 26, 33"
        },
        {
            "SEMESTRE": 7,
            "CODIGO": "ADS3007",
            "ORDEM": 39,
            "DISCIPLINA": "Projeto Temático III",
            "EMENTA": "Planejamento e aplicação de um projeto atual em Análise e Desenvolvimento de Sistemas. Definição de sua estrutura, organização e processo de elaboração.  Desenvolvimento de trabalho interdisciplinar em equipe. Resolução de problemas reais. Concepção e desenvolvimento de um sistema computacional. Integração, de forma interdisciplinar, das aprendizagens construídas nos diferentes componentes curriculares. ",
            "NAT": "FEP",
            "HORAS": 80,
            "PREREQUISITOS": "14, 33"
        },
        {
            "SEMESTRE": 7,
            "CODIGO": "FBI8002",
            "ORDEM": 40,
            "DISCIPLINA": "Interface Humano Computador",
            "EMENTA": "Caracterização de tipos de usuários e tipos de interfaces; caracterização de meios de interação; caracterização dos fatores humanos; desenvolvimento de layout de tela, orientação e navegação, design intercultural e acessibilidade; desenvolvimento de interfaces adaptativas; caracterização de realidade virtual e interfaces não convencionais; caracterização de agentes pedagógicos.",
            "NAT": "FED",
            "HORAS": 80,
            "PREREQUISITOS": 14
        },
        {
            "SEMESTRE": 8,
            "CODIGO": "EMP5000",
            "ORDEM": 41,
            "DISCIPLINA": "Empreendedorismo",
            "EMENTA": "Estudo do conceito e das características do empreendedorismo e análise de sua importância e suas finalidades no contexto da sociedade contemporânea. Definição do perfil do empreendedor e seus aspectos comportamentais. Estudo do processo de geração de ideias e de desenvolvimento da criatividade. Análises de negócios decorrentes de inovação. Desenvolvimento de Negócios com vistas à identificação de oportunidades e ao planejamento técnico, comercial e financeiro, considerando os princípios éticos e a sustentabilidade.",
            "NAT": "FBP",
            "HORAS": 80
        },
        {
            "SEMESTRE": 8,
            "CODIGO": "FBS4007",
            "ORDEM": 42,
            "DISCIPLINA": "Gestão de Projetos",
            "EMENTA": "Conceituação de gestão por projeto. Caracterização de elementos básicos do projeto e da função gerencial do gestor do projeto. Identificação de organizações internacionais na área de gerenciamento de projetos. Diferenciação de práticas de gestão de projetos. Estudo da gestão estruturada de projetos com aplicações das fases de um projeto e das áreas do conhecimento descritas no PMBOK. Elaboração de Plano de Projeto. Estabelecimento de relações entre os projetos e os diversos stakeholders identificados. Utilização de ferramentas de planejamento, acompanhamento e controle de projetos.",
            "NAT": "FEP",
            "HORAS": 80
        },
        {
            "SEMESTRE": 8,
            "CODIGO": "FBI4018",
            "ORDEM": 43,
            "DISCIPLINA": "Trabalho de Conclusão de Curso II",
            "EMENTA": "Desenvolvimento da proposta de um projeto de aplicação de computação científica elaborado na disciplina de TCC I. Desenvolvimento de trabalho interdisciplinar individual. Desenvolvimento de um artigo com os resultados do projeto desenvolvido.",
            "NAT": "FEP",
            "HORAS": 20,
            "PREREQUISITOS": 37
        },
        {
            "SEMESTRE": 8,
            "CODIGO": "ENS4002",
            "ORDEM": 44,
            "DISCIPLINA": "Segurança da Informação",
            "EMENTA": "Em construção",
            "NAT": "FED",
            "HORAS": 40,
            "PREREQUISITOS": 30
        },
        {
            "SEMESTRE": 8,
            "CODIGO": "ENS4003",
            "ORDEM": 45,
            "DISCIPLINA": "Teste de Software",
            "EMENTA": "Em construção",
            "NAT": "FEP",
            "HORAS": 80,
            "PREREQUISITOS": 14
        },
        {
            "SEMESTRE": 8,
            "CODIGO": "CIC8000",
            "ORDEM": 46,
            "DISCIPLINA": "Banco de Dados",
            "EMENTA": "Caracterização de sistemas de gerência de banco de dados multiusuário. Conceituação de transações de banco de dados. Identificação dos principais mecanismos de controle de concorrência de transações. Identificação dos recursos para suporte à recuperação de paradas e falhas. Conceituação de critérios de segurança e integridade de dados e de sistemas de bancos de dados distribuídos. Estudo de aplicações e tecnologias avançadas de bancos de dados. ",
            "NAT": "FED",
            "HORAS": 80,
            "PREREQUISITOS": 20
        }
    ]
}